{
  "irVersion": "1.0",
  "project": "omniavatar",
  "repository": "https://github.com/plexusone/omniavatar",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-07-16",
      "highlights": [
        { "description": "Render providers for all three vendors: generate a talking-head MP4 from narration audio via HeyGen, Tavus, or bitHuman" },
        { "description": "HeyGen and bitHuman render providers implement `render.AudioUploader` for uploading local narration files" },
        { "description": "Symmetric registry API: `GetLiveProvider` / `GetRenderProvider`" }
      ],
      "changed": [
        { "description": "registry functions renamed for surface symmetry: `RegisterAvatarProvider` → `RegisterLiveProvider`, `GetAvatarProvider` → `GetLiveProvider`, `ListAvatarProviders` → `ListLiveProviders`, `HasAvatarProvider` → `HasLiveProvider`, `GetAvatarProviderPriority` → `GetLiveProviderPriority`", "breaking": true, "commit": "9a3c4d4" },
        { "description": "requires omniavatar-core v0.3.0 (package `avatar` renamed to `live`; render `AvatarLister`/helpers)", "breaking": true, "commit": "464ab53" }
      ],
      "added": [
        { "description": "Render registry API: `RegisterRenderProvider`, `GetRenderProvider`, `ListRenderProviders`, `HasRenderProvider`, `GetRenderProviderPriority`", "commit": "9a3c4d4" },
        { "description": "Render surface for all three vendors — audio-driven talking-head generation via HeyGen, Tavus, and bitHuman. The render adapters live in the provider SDK repos (`heygen-go/omniavatar`, `tavus-go/omniavatar`, `bithuman-go/omniavatar`), depending only on `omniavatar-core`; the batteries `providers/{heygen,tavus,bithuman}` packages register them alongside the live adapters", "commit": "9a3c4d4" },
        { "description": "HeyGen and bitHuman render adapters implement `render.AudioUploader`; the HeyGen adapter implements `render.AvatarLister` (v2 avatars)", "commit": "9a3c4d4" },
        { "description": "All providers register both live and render surfaces via `providers/all`", "commit": "9a3c4d4" },
        { "description": "`render-basic` example generating a talking-head video from narration audio via any registered render provider", "commit": "5461d66" },
        { "description": "Unit tests for the live/render registry surfaces", "commit": "8e6e9aa" }
      ],
      "documentation": [
        { "description": "README.md and doc.go updated with quick starts for both surfaces and per-provider render options", "commit": "fbf21e8" },
        { "description": "Render specs added under `docs/specs/render/` (PRD, TRD, PLAN, ROADMAP)", "commit": "b51daa9" },
        { "description": "MkDocs site (getting started, provider pages, architecture/LiveKit/render-lifecycle guides, specs, releases)", "commit": "881ead4" },
        { "description": "`Docs` GitHub Actions workflow deploying the site via `mkdocs gh-deploy`", "commit": "d89d52f" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-07-12",
      "highlights": [
        { "description": "Initial release with HeyGen, Tavus, and bitHuman providers" },
        { "description": "Priority-based provider registry with auto-registration via init()" },
        { "description": "LiveKit token generation for avatar participants" }
      ],
      "added": [
        { "description": "`RegisterAvatarProvider()` for registering avatar provider factories" },
        { "description": "`GetAvatarProvider()` for retrieving registered providers by name" },
        { "description": "`ListAvatarProviders()` for discovering available providers" },
        { "description": "`HasAvatarProvider()` for checking provider registration" },
        { "description": "`GenerateAvatarToken()` for creating LiveKit tokens with avatar metadata" },
        { "description": "`LiveKitStartOptions` struct for platform-specific session initialization" },
        { "description": "`PriorityThin` (0) and `PriorityThick` (10) registration priority constants" },
        { "description": "`providers/heygen`: HeyGen LiveAvatar provider with LITE mode support" },
        { "description": "`providers/tavus`: Tavus Conversational Video provider with PAL support" },
        { "description": "`providers/bithuman`: bitHuman Real-time Avatars provider" },
        { "description": "`providers/all`: Convenience blank import for all providers" }
      ],
      "documentation": [
        { "description": "README.md with architecture, quick start, and provider details" },
        { "description": "Package documentation in doc.go with usage examples" },
        { "description": "docs/releases/v0.1.0.md release notes" }
      ]
    }
  ]
}
